MikroElektronika/core_packages/PIC/XC8/def/PIC16LF15376/mcu.h
// Register: PWM4CON
#define PWM4CON PWM4CON
extern volatile unsigned char           PWM4CON             __at(0x31A);
#ifndef _LIB_BUILD
asm("PWM4CON equ 031Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :4;
        unsigned POL                    :1;
        unsigned OUT                    :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned                        :4;
        unsigned PWM4POL                :1;
        unsigned PWM4OUT                :1;
        unsigned                        :1;
        unsigned PWM4EN                 :1;
    };
} PWM4CONbits_t;
extern volatile PWM4CONbits_t PWM4CONbits __at(0x31A);
// bitfield macros
#define _PWM4CON_POL_POSN                                   0x4
#define _PWM4CON_POL_POSITION                               0x4
#define _PWM4CON_POL_SIZE                                   0x1
#define _PWM4CON_POL_LENGTH                                 0x1
#define _PWM4CON_POL_MASK                                   0x10
#define _PWM4CON_OUT_POSN                                   0x5
#define _PWM4CON_OUT_POSITION                               0x5
#define _PWM4CON_OUT_SIZE                                   0x1
#define _PWM4CON_OUT_LENGTH                                 0x1
#define _PWM4CON_OUT_MASK                                   0x20
#define _PWM4CON_EN_POSN                                    0x7
#define _PWM4CON_EN_POSITION                                0x7
#define _PWM4CON_EN_SIZE                                    0x1
#define _PWM4CON_EN_LENGTH                                  0x1
#define _PWM4CON_EN_MASK                                    0x80
#define _PWM4CON_PWM4POL_POSN                               0x4
#define _PWM4CON_PWM4POL_POSITION                           0x4
#define _PWM4CON_PWM4POL_SIZE                               0x1
#define _PWM4CON_PWM4POL_LENGTH                             0x1
#define _PWM4CON_PWM4POL_MASK                               0x10
#define _PWM4CON_PWM4OUT_POSN                               0x5
#define _PWM4CON_PWM4OUT_POSITION                           0x5
#define _PWM4CON_PWM4OUT_SIZE                               0x1
#define _PWM4CON_PWM4OUT_LENGTH                             0x1
#define _PWM4CON_PWM4OUT_MASK                               0x20
#define _PWM4CON_PWM4EN_POSN                                0x7
#define _PWM4CON_PWM4EN_POSITION                            0x7
#define _PWM4CON_PWM4EN_SIZE                                0x1
#define _PWM4CON_PWM4EN_LENGTH                              0x1
#define _PWM4CON_PWM4EN_MASK                                0x80

// Register: PWM5DC
#define PWM5DC PWM5DC
extern volatile unsigned short          PWM5DC              __at(0x31C);
#ifndef _LIB_BUILD
asm("PWM5DC equ 031Ch");
#endif

// Register: PWM5DCL
#define PWM5DCL PWM5DCL
extern volatile unsigned char           PWM5DCL             __at(0x31C);
#ifndef _LIB_BUILD
asm("PWM5DCL equ 031Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :6;
        unsigned DC                     :2;
    };
    struct {
        unsigned                        :6;
        unsigned DC0                    :1;
        unsigned DC1                    :1;
    };
    struct {
        unsigned                        :6;
        unsigned PWM5DC0                :1;
        unsigned PWM5DC1                :1;
    };
    struct {
        unsigned                        :6;
        unsigned PWMPW0                 :1;
        unsigned PWMPW1                 :1;
    };
} PWM5DCLbits_t;
extern volatile PWM5DCLbits_t PWM5DCLbits __at(0x31C);
// bitfield macros
#define _PWM5DCL_DC_POSN                                    0x6
#define _PWM5DCL_DC_POSITION                                0x6
#define _PWM5DCL_DC_SIZE                                    0x2
#define _PWM5DCL_DC_LENGTH                                  0x2
#define _PWM5DCL_DC_MASK                                    0xC0
#define _PWM5DCL_DC0_POSN                                   0x6
#define _PWM5DCL_DC0_POSITION                               0x6
#define _PWM5DCL_DC0_SIZE                                   0x1
#define _PWM5DCL_DC0_LENGTH                                 0x1
#define _PWM5DCL_DC0_MASK                                   0x40
#define _PWM5DCL_DC1_POSN                                   0x7
#define _PWM5DCL_DC1_POSITION                               0x7
#define _PWM5DCL_DC1_SIZE                                   0x1
#define _PWM5DCL_DC1_LENGTH                                 0x1
#define _PWM5DCL_DC1_MASK                                   0x80
#define _PWM5DCL_PWM5DC0_POSN                               0x6
#define _PWM5DCL_PWM5DC0_POSITION                           0x6
#define _PWM5DCL_PWM5DC0_SIZE                               0x1
#define _PWM5DCL_PWM5DC0_LENGTH                             0x1
#define _PWM5DCL_PWM5DC0_MASK                               0x40
#define _PWM5DCL_PWM5DC1_POSN                               0x7
#define _PWM5DCL_PWM5DC1_POSITION                           0x7
#define _PWM5DCL_PWM5DC1_SIZE                               0x1
#define _PWM5DCL_PWM5DC1_LENGTH                             0x1
#define _PWM5DCL_PWM5DC1_MASK                               0x80
#define _PWM5DCL_PWMPW0_POSN                                0x6
#define _PWM5DCL_PWMPW0_POSITION                            0x6
#define _PWM5DCL_PWMPW0_SIZE                                0x1
#define _PWM5DCL_PWMPW0_LENGTH                              0x1
#define _PWM5DCL_PWMPW0_MASK                                0x40
#define _PWM5DCL_PWMPW1_POSN                                0x7
#define _PWM5DCL_PWMPW1_POSITION                            0x7
#define _PWM5DCL_PWMPW1_SIZE                                0x1
#define _PWM5DCL_PWMPW1_LENGTH                              0x1
#define _PWM5DCL_PWMPW1_MASK                                0x80

// Register: PWM5DCH
#define PWM5DCH PWM5DCH
extern volatile unsigned char           PWM5DCH             __at(0x31D);
#ifndef _LIB_BUILD
asm("PWM5DCH equ 031Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DC                     :8;
    };
    struct {
        unsigned DC2                    :1;
        unsigned DC3                    :1;
        unsigned DC4                    :1;
        unsigned DC5                    :1;
        unsigned DC6                    :1;
        unsigned DC7                    :1;
        unsigned DC8                    :1;
        unsigned DC9                    :1;
    };
    struct {
        unsigned PWM5DC2                :1;
        unsigned PWM5DC3                :1;
        unsigned PWM5DC4                :1;
        unsigned PWM5DC5                :1;
        unsigned PWM5DC6                :1;
        unsigned PWM5DC7                :1;
        unsigned PWM5DC8                :1;
        unsigned PWM5DC9                :1;
    };
    struct {
        unsigned PWMPW2                 :1;
        unsigned PWMPW3                 :1;
        unsigned PWMPW4                 :1;
        unsigned PWMPW5                 :1;
        unsigned PWMPW6                 :1;
        unsigned PWMPW7                 :1;
        unsigned PWMPW8                 :1;
        unsigned PWMPW9                 :1;
    };
} PWM5DCHbits_t;
